Docs: Update README (EN/RU), fixed repository link
